snlkuharlocal/src/InformationRegisters/ЖурналРегистрации/ЖурналРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналРегистрации</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изменения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияШапки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияТЧ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>КлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/Логи/Логи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Логи</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЛога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ПоказателиПроизводительности/ПоказателиПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиПроизводительности</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзмерения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/НастройкиЖурнализации/НастройкиЖурнализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиЖурнализации</name>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЖурнализацияТЧ</name>
    <attributes>
      <name>ИмяТЧ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Журнализация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыЖурнализацииТЧ</name>
    <attributes>
      <name>ИмяТЧ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/CommonModules/Журнализация/Module.bsl
Функция СравнитьТЗ(ТЗНач,ТЗКон,ЭтоНовый = Ложь)
	ТЗДельт=Новый ТаблицаЗначений;
	
	КлючевыеПоля=Новый Структура;
	ПоляДанных	=Новый Структура;
	
	Для Каждого Колонка Из ТЗнач.Колонки Цикл
		Поз=Найти(Колонка.Имя,"___");
		
		ИмяПоля=Лев(Колонка.Имя,Поз-1);
		ВидПоля=Сред(Колонка.Имя,Поз+3);
				
		Если ВидПоля="Ключ" Тогда
			КлючевыеПоля.Вставить(Колонка.Имя,ИмяПоля);
		ИначеЕсли ВидПоля="Параметр" Тогда		
			ПоляДанных.Вставить(Колонка.Имя,ИмяПоля);			
		КонецЕсли; 		
	КонецЦикла;
	
	Если КлючевыеПоля.Количество()=0 ИЛИ ПоляДанных.Количество()=0 Тогда
		Возврат Новый ТаблицаЗначений;			
	КонецЕсли; 
	
	//Феданченков М.С. 27.06.2026 начало
	//проблема 0000000154 
	Если ЭтоНовый ИЛИ ТЗНач.Количество() = 0 Тогда
		// Добавляем колонки в ТЗДельт для первичной записи
		Для Каждого ПолеКлюча Из КлючевыеПоля Цикл
			ТЗДельт.Колонки.Добавить(ПолеКлюча.Значение);	
		КонецЦикла;
		
		Для Каждого ПолеДанных Из ПоляДанных Цикл
			ТЗДельт.Колонки.Добавить(ПолеДанных.Значение+"__1");
			ТЗДельт.Колонки.Добавить(ПолеДанных.Значение+"__2");
		КонецЦикла;
		
		Для Каждого СтрокаТек Из ТЗКон Цикл
			НоваяСтрока = ТЗДельт.Добавить();
			
			Для Каждого ПолеКлюча Из КлючевыеПоля Цикл
				НоваяСтрока[ПолеКлюча.Значение] = СтрокаТек[ПолеКлюча.Ключ];
			КонецЦикла;
			
			Для Каждого ПолеДанных Из ПоляДанных Цикл
				НоваяСтрока[ПолеДанных.Значение+"__1"] = Неопределено;
				НоваяСтрока[ПолеДанных.Значение+"__2"] = СтрокаТек[ПолеДанных.Ключ];
			КонецЦикла;
		КонецЦикла;
		
		Возврат ТЗДельт;
	КонецЕсли;
	//Феданченков М.С. 27.06.2026 конец
	
	СтрокаСоединений="";	
	СтрокаУсловий	="";
	СтрокаКлючей	="";
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ * ПОМЕСТИТЬ НачТЧ ИЗ &НачТЧ КАК НачТЧ;
	|ВЫБРАТЬ * ПОМЕСТИТЬ КонТЧ ИЗ &КонТЧ КАК КонТЧ;
	|
	|ВЫБРАТЬ 
	|	";
	
	Для Каждого ПолеКлюча Из КлючевыеПоля Цикл
		ТЗДельт.Колонки.Добавить(ПолеКлюча.Значение);	
		
	СтрокаКлючей=СтрокаКлючей+?(ПустаяСтрока(СтрокаКлючей),"",",")+"
	|	IsNULL(НачТЧ."+ПолеКлюча.Ключ+",КонТЧ."+ПолеКлюча.Ключ+") КАК "+ПолеКлюча.Значение;
	
	СтрокаСоединений=СтрокаСоединений+"
	|	"+?(ПустаяСтрока(СтрокаСоединений),"","И ")+"НачТЧ."+ПолеКлюча.Ключ+"=КонТЧ."+ПолеКлюча.Ключ;	
	КонецЦикла;

	Запрос.Текст=Запрос.Текст+СтрокаКлючей;
	
	Для Каждого ПолеДанных Из ПоляДанных Цикл
		Запрос.Текст=Запрос.Текст+",
		|	НачТЧ."+ПолеДанных.Ключ+" КАК "+ПолеДанных.Значение+"__1,
		|	КонТЧ."+ПолеДанных.Ключ+" КАК "+ПолеДанных.Значение+"__2";
		
		СтрокаУсловий=СтрокаУсловий+"
		|	"+?(ПустаяСтрока(СтрокаУсловий),"","ИЛИ ")+"IsNull(НачТЧ."+ПолеДанных.Ключ+",1) <> IsNull(КонТЧ."+ПолеДанных.Ключ+",2)";
		
		ТЗДельт.Колонки.Добавить(ПолеДанных.Значение+"__1");
		ТЗДельт.Колонки.Добавить(ПолеДанных.Значение+"__2");
	КонецЦикла;	
	
	Запрос.Текст=Запрос.Текст+"	
	|ИЗ
	|	НачТЧ
	|ПОЛНОЕ СОЕДИНЕНИЕ 
	|	КонТЧ 
	|ПО "+СтрокаСоединений+"
	|ГДЕ
	|"+СтрокаУсловий;
	
	Запрос.УстановитьПараметр("НачТЧ",ТЗНач);
	Запрос.УстановитьПараметр("КонТЧ",ТЗКон);
	
	ТЗДельт=Запрос.Выполнить().Выгрузить();
	
	//Для Каждого СтрокаТЗНач Из ТЗНач Цикл
	//	СтруктураОтбора=Новый Структура;
	//	Для Каждого КлючевоеПоле Из КлючевыеПоля Цикл
	//		СтруктураОтбора.Вставить(КлючевоеПоле.Ключ,СтрокаТЗНач[КлючевоеПоле.Ключ]);					
	//	КонецЦикла; 
	//	
	//	СтрокиТЗКон=ТЗКон.НайтиСтроки(СтруктураОтбора);
	//	Для Каждого СтрокаТЗКон Из СтрокиТЗКон Цикл
	//		ЕстьРазница=Ложь;
	//		
	//		СтрокаДельт=ТЗДельт.Добавить();
	//		
	//		Для Каждого ПолеДанных Из ПоляДанных Цикл				
	//			СтрокаДельт[ПолеДанных.Значение+"__1"]=СтрокаТЗНач[ПолеДанных.Ключ];
	//			СтрокаДельт[ПолеДанных.Значение+"__2"]=СтрокаТЗКон[ПолеДанных.Ключ];
	//			
	//			Если СтрокаТЗНач[ПолеДанных.Ключ]<>СтрокаТЗКон[ПолеДанных.Ключ] Тогда
	//				ЕстьРазница=Истина;				
	//			КонецЕсли;			
	//			
	//			СтрокаТЗНач[ПолеДанных.Ключ]=Неопределено; //если один раз сравнили значит есть лишние строки и больше сравнивать не надо
	//		КонецЦикла; 			
	//		
	//		Если НЕ ЕстьРазница Тогда
	//			ТЗДельт.Удалить(СтрокаДельт);		
	//		Иначе
	//			Для Каждого ПолеКлюча Из КлючевыеПоля Цикл
	//				СтрокаДельт[ПолеКлюча.Значение]=СтрокаТЗКон[ПолеКлюча.Ключ];			
	//			КонецЦикла; 
	//		КонецЕсли;			
	//		
	//		ТЗКон.Удалить(СтрокаТЗКон);
	//	КонецЦикла;
	//	
	//	Если СтрокиТЗКон.ВГраница()<0 Тогда //Если в конечной таблице не удалось найти соотвествующую строку - значит ее удалили			
	//		СтрокаДельт=ТЗДельт.Добавить();
	//		Для Каждого ПолеДанных Из ПоляДанных Цикл				
	//			СтрокаДельт[ПолеДанных.Значение+"__1"]=СтрокаТЗНач[ПолеДанных.Ключ];
	//		КонецЦикла; 	
	//		Для Каждого ПолеКлюча Из КлючевыеПоля Цикл
	//			СтрокаДельт[ПолеКлюча.Значение]=СтрокаТЗНач[ПолеКлюча.Ключ];			
	//		КонецЦикла;
	//	КонецЕсли; 
	//КонецЦикла; 
	//
	////если остались строки в конечной таблице значит их не было в начальной
	//Для Каждого СтрокаТЗКон Из ТЗКон Цикл
	//	СтрокаДельт=ТЗДельт.Добавить();
	//	Для Каждого ПолеДанных Из ПоляДанных Цикл				
	//		СтрокаДельт[ПолеДанных.Значение+"__2"]=СтрокаТЗКон[ПолеДанных.Ключ];
	//	КонецЦикла; 	
	//	Для Каждого ПолеКлюча Из КлючевыеПоля Цикл
	//		СтрокаДельт[ПолеКлюча.Значение]=СтрокаТЗКон[ПолеКлюча.Ключ];			
	//	КонецЦикла;			
	//КонецЦикла;			
		
	Возврат ТЗДельт;
КонецФункции // СравнитьТЗ()
 
Функция ПолучитьИзмененияОбъекта(Ссылка, НачальноеСостояние, ДопПараметры = Неопределено)
	Тип = ТипОбъекта(Ссылка);
	Вид = Ссылка.Метаданные().Имя;
	
	Состояние = НачальноеСостояние.Состояние;
	
	ИзмененияРеквизитов = Новый ТаблицаЗначений;
	ИзмененияРеквизитов.Колонки.Добавить("Реквизит");
	ИзмененияРеквизитов.Колонки.Добавить("НачЗнач");
	ИзмененияРеквизитов.Колонки.Добавить("КонЗнач");
	
	РеквизитыШапки			= НачальноеСостояние.РеквизитыШапки;
	РеквизитыШапки_Текущие	= Новый Структура;	
	
	Для Каждого Элемент Из РеквизитыШапки Цикл
		РеквизитыШапки_Текущие.Вставить(Элемент.Ключ);
	КонецЦикла;	
	ЗаполнитьЗначенияСвойств(РеквизитыШапки_Текущие, Ссылка);
	
	Для Каждого Элемент Из РеквизитыШапки Цикл
		Если РеквизитыШапки_Текущие[Элемент.Ключ] <> Элемент.Значение Тогда
			СтрокаТИ=ИзмененияРеквизитов.Добавить();
			
			СтрокаТИ.Реквизит	= Элемент.Ключ;
			СтрокаТИ.НачЗнач	= "" + Элемент.Значение;
			СтрокаТИ.КонЗнач	= "" + РеквизитыШапки_Текущие[Элемент.Ключ];
		КонецЕсли; 
	КонецЦикла;
	
	ИзмененияТЧ = Новый Структура;
	
	НачРеквизитыТЧ=НачальноеСостояние.РеквизитыТЧ;
	Если НачРеквизитыТЧ.Количество()>0 Тогда
		КонРеквизитыТЧ = ПолучитьРеквизитыТЧ(Ссылка);		
		
		Для Каждого ТЧ Из НачРеквизитыТЧ Цикл
			НачТЧ = ТЧ.Значение;
			ТекТЧ = КонРеквизитыТЧ.Получить(ТЧ.Ключ);
			//Феданченков М.С. 27.06.2026 начало
			//проблема 0000000154 
			Изменения = СравнитьТЗ(НачТЧ, ТекТЧ, Состояние.Новый);
			//Феданченков М.С. 27.06.2026 конец
			Если Изменения.Количество()>0 Тогда
				ИзмененияТЧ.Вставить(ТЧ.Ключ, Изменения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СписокРеквизитов = Новый Структура("ПометкаУдаления");
	Если Тип = "Документ" Тогда
		СписокРеквизитов.Вставить("Проведен");
	КонецЕсли;	
	РеквизитыСсылки = ПолучитьРеквизитыШапки(Ссылка,СписокРеквизитов,Тип);
	
	//изменения в проведении
	СостояниеПроведения = Неопределено;
	Если Тип = "Документ" Тогда
		Если Состояние.Новый Тогда
			Если РеквизитыСсылки.Проведен Тогда
				СостояниеПроведения = "Проведение";
			КонецЕсли;	
		Иначе
			Если Состояние.Проведен Тогда
				Если РеквизитыСсылки.Проведен = Ложь Тогда
					СостояниеПроведения = "Отмена проведения";
				Иначе
					Если МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "РежимЗаписи") = РежимЗаписиДокумента.Проведение Тогда
						СостояниеПроведения = "Перепроведение";
					КонецЕсли;
				КонецЕсли;
			Иначе //Нач. состояние - "Не проведен"
				Если РеквизитыСсылки.Проведен Тогда
					СостояниеПроведения = "Проведение";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//изменения в пометках удаления
	СостояниеОбъекта = Неопределено; 
	Если Состояние.Новый Тогда		
		СостояниеОбъекта = "Первичная запись";	
	ИначеЕсли Состояние.ПометкаУдаления И НЕ РеквизитыСсылки.ПометкаУдаления Тогда
		СостояниеОбъекта = "Снятие пометки на удаление";
	ИначеЕсли НЕ Состояние.ПометкаУдаления И РеквизитыСсылки.ПометкаУдаления Тогда
		СостояниеОбъекта = "Пометка на удаление";	
	Иначе
		СостояниеОбъекта = "Перезапись";		
	КонецЕсли;
	
	Если СостояниеПроведения = Неопределено И СостояниеОбъекта = Неопределено И ИзмененияРеквизитов.Количество() = 0 И ИзмененияТЧ.Количество() = 0 Тогда
		Возврат Неопределено; //не было изменений
	Иначе
		Возврат Новый Структура("Тип,Вид,СостояниеПроведения,СостояниеОбъекта,ИзмененияРеквизитов,ИзмененияТЧ",Тип,Вид,СостояниеПроведения,СостояниеОбъекта,ИзмененияРеквизитов,ИзмененияТЧ);	
	КонецЕсли;	
КонецФункции // ПолучитьТаблицуИзменений()

Процедура ЗаписатьИзмененияВЖурнал(Ссылка, НачальноеСостояние, ПараметрыЗагрузки, ДопПараметры = Неопределено) Экспорт
	Изменения = ПолучитьИзмененияОбъекта(Ссылка, НачальноеСостояние, ДопПараметры);
	Если Изменения=Неопределено  Тогда  Возврат КонецЕсли;
	
	КлючЗаписи = Новый УникальныйИдентификатор();
	
	///////// ОТКРЫВАЕМ УПРАВЛЯЕМУЮ ТРАНЗАКЦИЮ /////////////////////////////
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	///////// ОТКРЫВАЕМ УПРАВЛЯЕМУЮ ТРАНЗАКЦИЮ /////////////////////////////
	
	Запись=РегистрыСведений.ЖурналРегистрации.СоздатьМенеджерЗаписи();
	
	Запись.ТекстСсылки		= Ссылка.УникальныйИдентификатор();
	Запись.Дата				= ТекущаяДата();
	
	Если Метаданные.РегистрыСведений.ЖурналРегистрации.Измерения.Найти("День")<>Неопределено Тогда	
		Запись.День			= Запись.Дата;	
	КонецЕсли;	
	
	Запись.Пользователь			= ПараметрыСеанса.Пользователь;
	Запись.КлючЗаписи			= КлючЗаписи;
	
	Запись.СостояниеОбъекта		= Изменения.СостояниеОбъекта;
	Запись.СостояниеПроведения	= Изменения.СостояниеПроведения;
	Запись.Тип					= Изменения.Тип;
	Запись.Вид					= Изменения.Вид;
	
	Запись.ИзмененияШапки		= Изменения.ИзмененияРеквизитов.Количество() > 0;
	Запись.ИзмененияТЧ			= Изменения.ИзмененияТЧ.Количество() > 0;
	//крохин начало 10.01.2012
	Попытка
		Запись.Изменения			=Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(Новый Структура("Реквизиты,ТЧ",Изменения.ИзмененияРеквизитов,Изменения.ИзмененияТЧ)),Новый СжатиеДанных(9));
	Исключение
		Запись.Изменения			=Новый ХранилищеЗначения("",Новый СжатиеДанных(9));		
	КонецПопытки;
	//крохин конец 10.01.2012	
	
	Если ПараметрыЗагрузки<>Неопределено И ПараметрыЗагрузки.Загрузка Тогда
		Запись.Отправитель=ПараметрыЗагрузки.Отправитель;				
		Если Запись.Отправитель<>Неопределено Тогда
			Запись.НомерСообщения=ПараметрыСеанса.НомерСообщения;		
		КонецЕсли; 
	КонецЕсли; 
	
	//Тимофеев Ю.А. Начало   10-12-2024
	// иногда падает
	// по причине: Конфликт блокировок при выполнении транзакции:Microsoft SQL Server Native Client 10.0:
	Попытка
		Запись.Записать(Ложь);
	Исключение
		//подождем три секунды
		ТекВремя = ТекущаяДатаСеанса()+3;		
		
		Пока ТекВремя>ТекущаяДатаСеанса() Цикл
			
		КонецЦикла;	
		//и еще раз попробуем записать
		Попытка
			Запись.Записать();
		Исключение
			//по наблюдаем пока
			ЗаписатьВЛог("Журнализация","Ошибка записи "+Строка(Ссылка),"Ошибка");
		КонецПопытки;
		
	КонецПопытки;		
	//Тимофеев Ю.А. Конец    10-12-2024
	                	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры



Процедура ЗаписатьУдалениеВЖурнал(Ссылка,ПараметрыЗагрузки) Экспорт
	Если ПараметрыСеанса.ОтключитьЖурнализациюЗаписи Тогда Возврат КонецЕсли;
	
	///////// ОТКРЫВАЕМ УПРАВЛЯЕМУЮ ТРАНЗАКЦИЮ /////////////////////////////
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	///////// ОТКРЫВАЕМ УПРАВЛЯЕМУЮ ТРАНЗАКЦИЮ /////////////////////////////
	
	Набор=РегистрыСведений.ЖурналРегистрации.СоздатьНаборЗаписей();
	
	Запись=Набор.Добавить();
	
	Запись.ТекстСсылки			=Ссылка.УникальныйИдентификатор();
	Запись.Дата					=ТекущаяДата();	
	//+++Чирков 16.01.13
	Если Метаданные.РегистрыСведений.ЖурналРегистрации.Измерения.Найти("День")<>Неопределено Тогда	
		Запись.День				=Запись.Дата;	
	КонецЕсли;
	//---Чирков 16.01.13
	Запись.Пользователь			=ПараметрыСеанса.Пользователь;
	Запись.КлючЗаписи			=Новый УникальныйИдентификатор();
	
	Запись.СостояниеОбъекта		="Удаление";
	Запись.СостояниеПроведения	="";
	Запись.Тип					=ТипОбъекта(Ссылка);
	Запись.Вид					=Ссылка.Метаданные().Имя;
	
	Запись.ИзмененияШапки		=Ложь;
	Запись.ИзмененияТЧ			=Ложь;	
	
	Если ПараметрыЗагрузки<>Неопределено И ПараметрыЗагрузки.Загрузка Тогда
		Запись.Отправитель=ПараметрыЗагрузки.Отправитель;				
		Если Запись.Отправитель<>Неопределено Тогда
			Запись.НомерСообщения=ПараметрыСеанса.НомерСообщения;		
		КонецЕсли; 
	КонецЕсли; 
	
	Набор.Записать(Ложь);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ПолучитьРеквизитыТЧ(Ссылка)
	ТипОбъекта=ТипОбъекта(Ссылка);
	ВидОбъекта=Ссылка.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ЖурнализацияТЧ.(ИмяТЧ),
	|	ПараметрыЖурнализацииТЧ.(ИмяТЧ,ИмяПоля,ВидПоля)
	|ИЗ
	|	Справочник.НастройкиЖурнализации КАК НастройкиЖурнализации
	|ГДЕ
	|	ТипОбъекта = &ТипОбъекта
	|	И ВидОбъекта = &ВидОбъекта
	|	И ЖурнализацияТЧ.Журнализация
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТипОбъекта",ТипОбъекта);
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	
	СписокТЧ=Новый Соответствие;
	
	Если ТипОбъекта="Документ" Тогда
		МетаОбъект=Метаданные.Документы[ВидОбъекта];
	Иначе 
		МетаОбъект=Метаданные.Справочники[ВидОбъекта];
	КонецЕсли;	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВыборкаПоТЧ=Выборка.ЖурнализацияТЧ.Выбрать();
		Пока ВыборкаПоТЧ.Следующий() Цикл			
			ИмяТЧ=ВыборкаПоТЧ.ИмяТЧ;
			
			СтрокаРеквизитов="";
			ВыборкаПоРеквизитам=Выборка.ПараметрыЖурнализацииТЧ.Выбрать();
			Пока ВыборкаПоРеквизитам.Следующий() Цикл
				Если ВыборкаПоРеквизитам.ИмяТЧ<>ИмяТЧ Тогда Продолжить КонецЕсли;
							
				ТипРеквизита=МетаОбъект.ТабличныеЧасти[ИмяТЧ].Реквизиты[ВыборкаПоРеквизитам.ИмяПоля].Тип;				
				
				Если ТипРеквизита.СодержитТип(Тип("Строка")) И ТипРеквизита.КвалификаторыСтроки.Длина=0 Тогда
					СтрокаРеквизитов=СтрокаРеквизитов+?(ПустаяСтрока(СтрокаРеквизитов),"",",")+" ВЫРАЗИТЬ("+ВыборкаПоРеквизитам.ИмяПоля +" КАК СТРОКА(1000)) КАК "+ВыборкаПоРеквизитам.ИмяПоля+"___"+ВыборкаПоРеквизитам.ВидПоля;
				Иначе
					СтрокаРеквизитов=СтрокаРеквизитов+?(ПустаяСтрока(СтрокаРеквизитов),"",",")+ВыборкаПоРеквизитам.ИмяПоля +" КАК "+ВыборкаПоРеквизитам.ИмяПоля+"___"+ВыборкаПоРеквизитам.ВидПоля;
				КонецЕсли;				
			КонецЦикла;			
			
			ЗапросПоРеквизитам=Новый Запрос;
			ЗапросПоРеквизитам.Текст="ВЫБРАТЬ "+СтрокаРеквизитов+" ИЗ "+ТипОбъекта+"."+ВидОбъекта+"."+ИмяТЧ+" ГДЕ Ссылка=&Ссылка";
			ЗапросПоРеквизитам.УстановитьПараметр("Ссылка",Ссылка);
			
			ТЧ=ЗапросПоРеквизитам.Выполнить().Выгрузить();
			
			СписокТЧ.Вставить(ИмяТЧ,ТЧ);			
		КонецЦикла;		
	КонецЦикла;	
	
	Возврат СписокТЧ;
КонецФункции // ПолучитьОбразыТЧ()

Функция ПолучитьСостояниеОбъекта(Ссылка, Модифицированность) Экспорт
    Тип			= ТипОбъекта(Ссылка);
	МетаОбъект	= Ссылка.Метаданные();	
	
	ПоляСостояния = Новый Массив;
	
	ПоляСостояния.Добавить("ПометкаУдаления");
		
	Если Тип = "Документ" Тогда
		ПоляСостояния.Добавить("Проведен");		
	ИначеЕсли Тип = "Справочник" Тогда			
		Если МетаОбъект.Иерархический Тогда
			ПоляСостояния.Добавить("Родитель");
			Если МетаОбъект.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
				ПоляСостояния.Добавить("ЭтоГруппа");							
			КонецЕсли;
		КонецЕсли; 		
		
		Если МетаОбъект.Владельцы.Количество() > 0 Тогда
			ПоляСостояния.Добавить("Владелец");		
		КонецЕсли;	
	КонецЕсли;
	
	Если ПоляСостояния.Количество() > 0 Тогда
		Состояние = ПолучитьРеквизитыШапки(Ссылка, СтрСоединить(ПоляСостояния, ","), Тип);
	    Состояние.Вставить("Новый", Ссылка.Пустая());
	Иначе           
		Состояние = Новый Структура;
	КонецЕсли;	
	
	РеквизитыШапки	= Новый Структура;
	РеквизитыТЧ		= Новый Соответствие;
	
	Если Модифицированность Тогда		
		ПоляШапки = Новый Массив;
		
		Если Тип = "Документ" Тогда
			ПоляШапки.Добавить("Номер");
			ПоляШапки.Добавить("Дата");
		ИначеЕсли Тип = "Справочник" Тогда
			Если МетаОбъект.ДлинаКода > 0 Тогда			
				ПоляШапки.Добавить("Код");
			КонецЕсли;
			Если МетаОбъект.ДлинаНаименования > 0 Тогда			
				ПоляШапки.Добавить("Наименование");
			КонецЕсли;                          
			Если МетаОбъект.Иерархический Тогда
				ПоляШапки.Добавить("Родитель");			
			КонецЕсли;
			Если МетаОбъект.Владельцы.Количество() > 0 Тогда
				ПоляШапки.Добавить("Владелец");			
			КонецЕсли;		
		КонецЕсли;	
		
		СтрокаСвойств = "";
		Для Каждого МетаРеквизит Из МетаОбъект.Реквизиты Цикл
			Нужно = Истина;
			Если Тип = "Справочник" Тогда
				Если МетаОбъект.Иерархический Тогда
					Если МетаРеквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы Тогда
						Если Состояние.ЭтоГруппа <> Истина Тогда
							Нужно = Ложь;																				
						КонецЕсли;					
					ИначеЕсли МетаРеквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента Тогда
						Если Состояние.ЭтоГруппа <> Ложь Тогда
							Нужно = Ложь;																				
						КонецЕсли;												
					КонецЕсли;				
				КонецЕсли;			
			КонецЕсли;
			
			//Если НЕ МетаРеквизит.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Если Нужно Тогда
				ПоляШапки.Добавить(МетаРеквизит.Имя);							
			КонецЕсли;			
		КонецЦикла;			                   
		
		РеквизитыШапки = ПолучитьРеквизитыШапки(Ссылка, СтрСоединить(ПоляШапки, ","));
		
		РеквизитыТЧ = ПолучитьРеквизитыТЧ(Ссылка);
	КонецЕсли;	
	
	Возврат Новый Структура("Состояние,РеквизитыШапки,РеквизитыТЧ", Состояние, РеквизитыШапки, РеквизитыТЧ);	
КонецФункции // ПолучитьСостояниеОбъекта()

Функция ПолучитьИзмененияОбъектаИзXML(Данные,НачальноеСостояние) Экспорт
	МетаОбъект=Данные.Метаданные();
	
	Тип=ТипОбъекта(Данные);
	Вид=МетаОбъект.Имя;
	
	Состояние=НачальноеСостояние.Состояние;
	
	ИзмененияРеквизитов=Новый ТаблицаЗначений;
	ИзмененияРеквизитов.Колонки.Добавить("Реквизит");
	ИзмененияРеквизитов.Колонки.Добавить("Знач__1");
	ИзмененияРеквизитов.Колонки.Добавить("Знач__2");
	
	
	ИзмененияСостояния=Новый ТаблицаЗначений;
	ИзмененияСостояния.Колонки.Добавить("Реквизит");
	ИзмененияСостояния.Колонки.Добавить("Знач__1");
	ИзмененияСостояния.Колонки.Добавить("Знач__2");	
	
	РеквизитыШапки=НачальноеСостояние.РеквизитыШапки;
	
	Для Каждого Элемент Из РеквизитыШапки Цикл
		ИмяРеквизита=Элемент.Ключ;
		Если Данные[ИмяРеквизита]<>Элемент.Значение Тогда			
			СтрокаТИ=ИзмененияРеквизитов.Добавить();
			
			СтрокаТИ.Реквизит	=Элемент.Ключ;
			
			Если Найти("Номер,Дата",ИмяРеквизита)=0 Тогда
				ТипРеквизита		=""+МетаОбъект.Реквизиты[ИмяРеквизита].Тип;			
			КонецЕсли;			
			
			Если ТипРеквизита="Число" Тогда
				СтрокаТИ.Знач__1=Данные[ИмяРеквизита];
				СтрокаТИ.Знач__2=Элемент.Значение;						
			Иначе
				СтрокаТИ.Знач__1=Данные[ИмяРеквизита];
				СтрокаТИ.Знач__2=Элемент.Значение;
			КонецЕсли;			
		КонецЕсли; 
	КонецЦикла;
	
	ИзмененияТЧ=Новый Структура;
	
	РеквизитыТЧ__2=НачальноеСостояние.РеквизитыТЧ;
	Если РеквизитыТЧ__2.Количество()>0 Тогда
		РеквизитыТЧ__1=ПолучитьРеквизитыТЧИзXML(Данные);		
		
		Для Каждого ТЧ Из РеквизитыТЧ__2 Цикл			
			ТЧ__1=РеквизитыТЧ__1.Получить(ТЧ.Ключ);
			ТЧ__2=ТЧ.Значение;
			//Феданченков М.С. 27.06.2026 начало
			//проблема 0000000154 
			Изменения=СравнитьТЗ(ТЧ__1,ТЧ__2,Состояние.Новый);
			//Феданченков М.С. 27.06.2026 конец
			Если Изменения.Количество()>0 Тогда
				ИзмененияТЧ.Вставить(ТЧ.Ключ,Изменения);				
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
			
	//изменения в проведении
	СостояниеПроведения=Неопределено;		
	Если Тип="Документ" Тогда
		Если Состояние.Проведен И Данные.Проведен=Ложь Тогда
			СостояниеПроведения="Отмена проведения";	
		ИначеЕсли НЕ Состояние.Проведен И Данные.Проведен Тогда
			СостояниеПроведения="Проведение";			
		ИначеЕсли Состояние.Проведен Тогда			
			СостояниеПроведения="Перепроведение";
		КонецЕсли;		
		
		Если Состояние.Проведен<>Данные.Проведен Тогда
			СтрокаИС=ИзмененияСостояния.Добавить();
			СтрокаИС.Реквизит	="ПризнакПроведения";
			
			СтрокаИС.Знач__1	=Данные.Проведен;
			СтрокаИС.Знач__2	=Состояние.Проведен;			
		КонецЕсли; 
		Если Состояние.ПометкаУдаления<>Данные.ПометкаУдаления Тогда
			СтрокаИС=ИзмененияСостояния.Добавить();
			СтрокаИС.Реквизит	="ПометкаУдаления";
			
			СтрокаИС.Знач__1	=Данные.ПометкаУдаления;
			СтрокаИС.Знач__2	=Состояние.ПометкаУдаления;			
		КонецЕсли;
	КонецЕсли;	
	
	//изменения в пометках удаления
	СостояниеОбъекта=Неопределено;
	Если Состояние.ПометкаУдаления И НЕ Данные.ПометкаУдаления  Тогда
		СостояниеОбъекта="Снятие пометки на удаление";
	ИначеЕсли НЕ Состояние.ПометкаУдаления И Данные.ПометкаУдаления  Тогда
		СостояниеОбъекта="Пометка на удаление";
	ИначеЕсли Состояние.Новый Тогда		
		СостояниеОбъекта="Первичная запись";
	Иначе
		СостояниеОбъекта="Перезапись";		
	КонецЕсли;
	
	Если СостояниеПроведения=Неопределено И СостояниеОбъекта=Неопределено И ИзмененияРеквизитов.Количество()=0 И ИзмененияТЧ.Количество()=0 Тогда
		Возврат Неопределено;	//не было изменений
	Иначе
		Возврат Новый Структура("Тип,Вид,СостояниеПроведения,СостояниеОбъекта,ИзмененияСостояния,ИзмененияРеквизитов,ИзмененияТЧ",Тип,Вид,СостояниеПроведения,СостояниеОбъекта,ИзмененияСостояния,ИзмененияРеквизитов,ИзмененияТЧ);	
	КонецЕсли;	
КонецФункции // ПолучитьТаблицуИзменений()

Функция ПолучитьРеквизитыТЧИзXML(Данные)
	ТипОбъекта=ТипОбъекта(Данные);
	МетаОбъект=Данные.Метаданные();
	ВидОбъекта=МетаОбъект.Имя;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ЖурнализацияТЧ.(ИмяТЧ),
	|	ПараметрыЖурнализацииТЧ.(ИмяТЧ,ИмяПоля,ВидПоля)
	|ИЗ
	|	Справочник.НастройкиЖурнализации КАК НастройкиЖурнализации
	|ГДЕ
	|	ТипОбъекта = &ТипОбъекта
	|	И ВидОбъекта = &ВидОбъекта
	|	И ЖурнализацияТЧ.Журнализация
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТипОбъекта",ТипОбъекта);
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	
	СписокТЧ=Новый Соответствие;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВыборкаПоТЧ=Выборка.ЖурнализацияТЧ.Выбрать();
		Пока ВыборкаПоТЧ.Следующий() Цикл			
			ИмяТЧ=ВыборкаПоТЧ.ИмяТЧ;
			
			ИменаКолонок=Новый Структура;
			
			СтрокаРеквизитов="";
			ВыборкаПоРеквизитам=Выборка.ПараметрыЖурнализацииТЧ.Выбрать();
			Пока ВыборкаПоРеквизитам.Следующий() Цикл
				Если ВыборкаПоРеквизитам.ИмяТЧ<>ИмяТЧ Тогда Продолжить КонецЕсли; 
				
				СтрокаРеквизитов=СтрокаРеквизитов+?(ПустаяСтрока(СтрокаРеквизитов),"",",")+ВыборкаПоРеквизитам.ИмяПоля;
				ИменаКолонок.Вставить(ВыборкаПоРеквизитам.ИмяПоля,ВыборкаПоРеквизитам.ИмяПоля+"___"+ВыборкаПоРеквизитам.ВидПоля);				
			КонецЦикла;			
								
			ТЧ=Данные[ИмяТЧ].Выгрузить();
			
			Для Каждого Колонка Из ИменаКолонок Цикл
				ТЧ.Колонки[Колонка.Ключ].Имя=Колонка.Значение;			
			КонецЦикла;
			
			Для Каждого КолонкаТЧ Из МетаОбъект.ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл
				Если НЕ ИменаКолонок.Свойство(КолонкаТЧ.Имя) Тогда
					ТЧ.Колонки.Удалить(ТЧ.Колонки[КолонкаТЧ.Имя]);
				КонецЕсли;
			КонецЦикла;
			
			СписокТЧ.Вставить(ИмяТЧ,ТЧ);			
		КонецЦикла;		
	КонецЦикла;	
	
	Возврат СписокТЧ;

КонецФункции // ПолучитьОбразыТЧ()

Функция ПолучитьСостояниеОбъектаИзXML(Данные) Экспорт
    Тип			=ТипОбъекта(Данные);
	МетаОБъект	=Данные.Метаданные();
	
	Образ=Новый Структура;	
		
	Если Тип="Документ" Тогда
		Состояние=Новый Структура("Проведен,ПометкаУдаления,Новый",Данные.Проведен,Данные.ПометкаУдаления,Данные.Ссылка.Пустая());		
	ИначеЕсли Тип="Справочник" Тогда
		Состояние=Новый Структура("ПометкаУдаления,Новый",Данные.ПометкаУдаления,Данные.Ссылка.Пустая());
	КонецЕсли;
	
	РеквизитыШапки	=Новый Структура;
	РеквизитыТЧ		=Новый Соответствие;
	
	
	Если Тип="Документ" Тогда
		РеквизитыШапки.Вставить("Номер",Данные.Номер);
		РеквизитыШапки.Вставить("Дата",Данные.Дата);
	ИначеЕсли Тип="Справочник" Тогда
		РеквизитыШапки.Вставить("Код",Данные.Код);
		РеквизитыШапки.Вставить("Наименование",Данные.Наименование);		
	КонецЕсли;	
		
	Для Каждого МетаРеквизит Из МетаОбъект.Реквизиты Цикл
		РеквизитыШапки.Вставить(МетаРеквизит.Имя,Данные[МетаРеквизит.Имя]);	
	КонецЦикла;
		
	РеквизитыТЧ=ПолучитьРеквизитыТЧИзXML(Данные);	
	
	Возврат Новый Структура("Состояние,РеквизитыШапки,РеквизитыТЧ",Состояние,РеквизитыШапки,РеквизитыТЧ);	
КонецФункции // ПолучитьСостояниеОбъекта()


Процедура глПередЗаписью(Ссылка,Отказ,Модифицированность,НачальноеСостояние,Место) Экспорт
	Если ПараметрыСеанса.ОтключитьЖурнализациюЗаписи Тогда Возврат КонецЕсли;	
	Если Отказ Тогда Возврат КонецЕсли; 
	
	Если Место="Модуль" Тогда
		НачальноеСостояние=ПолучитьСостояниеОбъекта(Ссылка,Модифицированность);
	Иначе
		НачальноеСостояние=Неопределено;
	КонецЕсли;	
КонецПроцедуры
 
Процедура глПриЗаписи(Ссылка,Отказ,НачальноеСостояние,Место,ПараметрыЗагрузки=Неопределено) Экспорт	
	Если ПараметрыСеанса.ОтключитьЖурнализациюЗаписи Тогда Возврат КонецЕсли;  
	
	Если Место="Модуль" И НачальноеСостояние<>Неопределено Тогда
		ЗаписатьИзмененияВЖурнал(Ссылка,НачальноеСостояние,ПараметрыЗагрузки);	
	КонецЕсли;
КонецПроцедуры

Процедура глПослеЗаписи(Ссылка,Место) Экспорт
	//Сообщить("После записи: "+Место+ТипОбъекта(ТипЗнч(Ссылка)));
КонецПроцедуры


//ЖУРНАЛИЗАЦИЯ

Процедура ЗаписатьПроОтправкуНаСклад(Ссылка,Получатель) Экспорт
	
	///////// ОТКРЫВАЕМ УПРАВЛЯЕМУЮ ТРАНЗАКЦИЮ /////////////////////////////
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	///////// ОТКРЫВАЕМ УПРАВЛЯЕМУЮ ТРАНЗАКЦИЮ /////////////////////////////
	
	НаборЗаписей=РегистрыСведений.ЖурналРегистрации.СоздатьНаборЗаписей();
	
	Запись=НаборЗаписей.Добавить();
	
	//Запись.СсылкаНаОбъект		=Ссылка;
	Запись.ТекстСсылки			=Ссылка.УникальныйИдентификатор();
	Запись.КлючЗаписи			=Новый УникальныйИдентификатор;
	
	Запись.Тип					=ТипОбъекта(Ссылка);
	Запись.Вид					=Ссылка.Метаданные().Имя;
	
	Запись.СостояниеПроведения	="Отправка на склад";
	Запись.СостояниеОбъекта		="Получатель: "+Получатель.Код;	
	
	Запись.Пользователь			=ПараметрыСеанса.Пользователь;
	Запись.Дата					=ТекущаяДата();
	//+++Чирков 16.01.13
	Если Метаданные.РегистрыСведений.ЖурналРегистрации.Измерения.Найти("День")<>Неопределено Тогда	
		Запись.День				=Запись.Дата;	
	КонецЕсли;
	//---Чирков 16.01.13
	
	НаборЗаписей.Записать(Ложь);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

//считывает начальный образ объекта
Функция ПолучитьНачальныйОбраз(Ссылка) Экспорт
	Образ = Новый Соответствие;
	
	ОбъектМД = Метаданные.НайтипоТипу(ТипЗнч(Ссылка));
	
	Если Метаданные.Справочники.Индекс(ОбъектМД)>0 Тогда
		Образ.Вставить("Код",			Ссылка.Код);				
		Образ.Вставить("Наименование",	Ссылка.Наименование);		
	ИначеЕсли Метаданные.Документы.Индекс(ОбъектМД)>0 Тогда
		Образ.Вставить("Номер",	Ссылка.Номер);				
		Образ.Вставить("Дата",	Ссылка.Дата);		
	Иначе
		Возврат Образ;	
	КонецЕсли;	
	
	Для Каждого Реквизит Из Ссылка.Метаданные().Реквизиты Цикл
		Образ.Вставить(Реквизит.Имя, Ссылка[Реквизит.Имя]);
	КонецЦикла; 	
	
	Возврат Образ;
КонецФункции // ПолучитьНачальныйОбраз()

//ЛОГИ
Функция ЗаписатьВЛог(ИмяЛога,Сообщение,ТипСообщения,ВыводитьСообщения=Ложь,НастройкиОтчета=Неопределено,ВремяВыполнения=Неопределено) Экспорт
	ПараметрыСеанса.НомерЗаписиЛога=ПараметрыСеанса.НомерЗаписиЛога+1;
	
	Запись=РегистрыСведений.Логи.СоздатьМенеджерЗаписи();
	
	Запись.Дата=ТекущаяДата();
	Если Метаданные.РегистрыСведений.Логи.Измерения.Найти("День")<>Неопределено Тогда
		Запись.День=Запись.Дата;
	КонецЕсли;		
	
	Запись.НомерЗаписи	=ПараметрыСеанса.НомерЗаписиЛога;
	Запись.ИмяЛога		=ИмяЛога;
	Запись.Автор		=ПараметрыСеанса.Пользователь;
	Запись.Сообщение	=Сообщение;
	Запись.ТипСообщения	=ТипСообщения;
	
	Запись.ДопИнфо			= Новый ХранилищеЗначения(НастройкиОтчета,Новый СжатиеДанных(9));
	Запись.ВремяВыполненния = ВремяВыполнения;
	
	//крохин начало 17.09.2021
	//ошибка записи сообщения об ошибке не должна вешать обмен
	Попытка
		//+++Чирков 02.04.2025 чтобы не было ненужных удалений
		//Запись.Записать();
		Запись.Записать(Ложь);
		//---Чирков 02.04.2025
		#ЕСЛИ КЛИЕНТ ТОГДА
			Если ВыводитьСообщения Тогда
				Сообщить(Сообщение);	
			КонецЕсли; 
		#КОНЕЦЕСЛИ
	Исключение
		// Кухарь А.Ю. 01.12.2021 начало
		//Если логи висят, то бесконечная рекурсия
		// ЗаписатьВЛог("Ошибка записи в лог",ОписаниеОшибки(),"Информация"); 
		// Кухарь А.Ю. 01.12.2021 конец
		
		
	КонецПопытки;
	//крохин конец 17.09.2021
КонецФункции // ЗаписатьВЛог()


Функция ЗаписатьПоказательПроизводительности(ИмяПоказателя,ЗначениеПоказателя) Экспорт
	Запись=РегистрыСведений.ПоказателиПроизводительности.СоздатьМенеджерЗаписи();	
	
	Запись.Подразделение=ПараметрыСеанса.ЭтотУзел.Подразделение;
	Запись.Показатель	=ИмяПоказателя;
	Запись.ДатаИзмерения=ТекущаяДата();
	Запись.Значение		=ЗначениеПоказателя;
	
	Запись.Пользователь	=ПараметрыСеанса.Пользователь;
	Запись.ИмяКомпьютера=ИмяКомпьютера();
	
	Запись.Записать();
КонецФункции //ЗаписатьПоказательПроизводительности()
